Extensions/УВМ/InformationRegisters/бит_ум_КонтролирующиеОрганыПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_ум_КонтролирующиеОрганыПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/CommonModules/УВМ_ОбщегоНазначенияКлиентСервер/Ext/Module.bsl
#Область УчетМигрантов

&НаСервере
// + 20240126 БаринбергГМ (165376)
// - 20240126 БаринбергГМ (165376)
Функция ПолучитьКонтролирующийОрган(фОрганизация, фДата, фДействия) Экспорт
	
	фРезультат = Справочники.бит_ум_ГосударственныеОрганы.ПустаяСсылка();
	ИспользоватьОтборПоДействиям = Ложь;
	
	Если ТипЗнч(фДействия) = Тип("Массив") и ЗначениеЗаполнено(фДействия) Тогда
		ИспользоватьОтборПоДействиям = Истина;
	Иначе
		фДействия = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_ум_КонтролирующиеОрганыПоОрганизациямСрезПоследних.КонтролирующийОрган КАК КонтролирующийОрган
	               |ИЗ
	               |	РегистрСведений.бит_ум_КонтролирующиеОрганыПоОрганизациям.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И ВЫБОР
	               |					КОГДА &ИспользоватьОтборПоДействиям
	               |						ТОГДА Действие В (&мДействия)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК бит_ум_КонтролирующиеОрганыПоОрганизациямСрезПоследних";
	Запрос.УстановитьПараметр("Организация", фОрганизация);
	Запрос.УстановитьПараметр("Дата", фДата);
	Запрос.УстановитьПараметр("мДействия", фДействия);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоДействиям", ИспользоватьОтборПоДействиям);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		фРезультат = Выборка.КонтролирующийОрган;
	КонецЕсли;
	
	Возврат фРезультат;
	
КонецФункции

#КонецОбласти
